Repository: brian0908/NTU-Course2Cal
Catalog: NTU-Course2Cal/Localizable.xcstrings
Source language: zh_hant
Languages: en

source: %lld 學分
en: %lld units

source: - 若解析失敗，先檢查是否有從正確的「列表」頁面選取正確範圍。 - 如果選課結果有更新，請再貼上一次最新的資料，重新解析。
en: - If decoding fails, check if you have correctly copied the course information from the course list. - If class schedule has changed, please import again to update the information.

source: %lld 分鐘前
en: %lld minutes before

source: AI 解析並匯入課程
en: AI Decode & Import

source: AI 解析中...
en: AI Decoding…

source: App 通知提前 %lld 分鐘提醒
en: App notifies %lld before

source: App 通知提醒
en: App Notifications

source: Google 行事曆設定
en: Google Calendar Settings

# nav_history_courses_title
source: 歷史課程
en: Archive

# nav_my_courses_title
source: 我的課程
en: My Classes

# nav_settings_title
source: 設定
en: Settings

# nav_weekly_schedule_title
source: 我的課表
en: My Schedule

source: Step 1: 建立新行事曆 (Optional)
en: Step 1: Create New Calendar (Optional)

source: Step 1: 打開新課程網
en: Step 1: Go to NTU Course Website

source: Step 2: 選取文字並複製
en: Step 2: Select and copy text

source: Step 2: 選擇匯入的行事曆
en: Step 2: Select calendar to import

source: Step 3: 貼到 NTU Course2Cal
en: Step 3: Paste to NTU Course2Cal

# tab_history_courses
source: 歷史課程
en: Archive

# tab_my_courses
source: 我的課程
en: My Courses

# tab_settings
source: 設定
en: Settings

# tab_weekly_schedule
source: 課表檢視
en: Schedule

source: 上課前提醒時間
en: Notification before class:

source: 上課時間
en: Class Time

source: 不提醒
en: No notifications

source: 例如 114-1 課表
en: e.g. 2025 Fall

source: 例如：114-1
en: e.g. 2025 Fall

source: 例如：114-1 課表
en: e.g. 2025 Fall

source: 備註
en: Additional info:

source: 允許匯入到行事曆
en: Allow Import to Calendar

source: 先跳過，下次再設定
en: Skip and set up later

source: 切換學期
en: Select Semester

source: 刪除
en: Delete

source: 前往匯入課程
en: Go to import classes

source: 前往臺大課程網
en: Go to NTU Course Website

source: 前往設定
en: Go to Settings

source: 包含目前學期與歷史課程的所有資料都會被刪除，此動作無法復原。
en: All data will be deleted from the current semester and archive. This action cannot be reversed.

source: 匯入課程
en: Import classes

source: 匯入課表
en: Import class schedule

source: 匯出
en: Export

source: 匯出中...
en: Exporting…

source: 匯出到 Apple 行事曆
en: Export to Apple Calendar

source: 匯出到 Google 行事曆
en: Export to Google Calendar

source: 匯出目前勾選的課程
en: Export Selected Classes

source: 匯出結果
en: Export Results

source: 匯出至 Apple 行事曆
en: Export to Apple Calendar

source: 匯出至 Google 行事曆
en: Export to Google Calendar

source: 取消
en: Cancel

source: 回到 NTU Course2Cal app，在「我的課程」頁面點選「貼上課表」。
en: Return to NTU Course2Cal App, then select “Paste Class Schedule” on the My Classes page.

source: 如何從臺大新課程網複製課表
en: How to copy your class info from the new NTU Course website

source: 學期
en: Semester

source: 學期名稱
en: Name of Semester

source: 學期管理
en: Semester Management

source: 將目前學期移至歷史課程
en: Move current semester to Archives

source: 小提示
en: Tips

source: 已登入
en: Logged In As:

source: 建立中...
en: Creating…

source: 建立學期並切換
en: Create Semester and Select

source: 建立新學期
en: Create New Semester

source: 建立新行事曆
en: Create New Calendar

source: 從剪貼簿貼上
en: Paste from clipboard

source: 必要設定
en: Required Settings

source: 快匯入本學期的課程吧！
en: Import classes for this semester!

source: 找不到任何 Google 行事曆
en: Cannot find any Google Calendars

source: 找不到可寫入的 Apple 行事曆
en: Cannot find any Apple Calendars

source: 提前 %lld 分鐘
en: %lld minutes before

source: 提前 %lld 分鐘通知
en: Notify %lld minutes before

source: 啟用 App 通知
en: Enable App Notifications

source: 新學期
en: New Semester

source: 日期
en: Date

source: 日期設定
en: Date Settings

source: 會用在匯出到行事曆的事件提醒。
en: Used for events exported to your calendar

source: 本 App 需要您的同意，才能將選課結果自動匯入 iOS 行事曆。
en: We need your consent to import the class schedule to Apple Calendar

source: 本學期開學第一天
en: First Day of the Semester

source: 查看複製課表教學
en: Go to Tutorial

source: 歡迎使用 NTU Course2Cal
en: Welcome to NTU Course2Cal

source: 此動作無法復原，且課程將不可再編輯。
en: This action cannot be reversed, and the class will be removed permanently.

source: 此學期沒有課程資料
en: No class info for this semester

source: 清除
en: Delete

source: 清除全部資料
en: Delete all Info

source: 無法從貼上的文字中解析出任何課程，請確認內容是否為臺大課程網的課程列表。
en: The system cannot decode any classes from the text. Please check if you have provided the correct information.

source: 登入後，進入右上角「選課結果」，並且確定出現「列表」畫面。
en: After logging in, select the Final Result List from the top right, and ensure you have selected the List view. (Currently only supports Chinese class info)

source: 登出 Google
en: Log Out

source: 目前學期：%@
en: Current Semester: %@

source: 目前尚未建立學期
en: No Semesters Created

source: 目前沒有內容，請先到臺大課程網複製課程列表，再按上方按鈕貼上。
en: No info imported, please go to the NTU Course Website to copy class information, then paste using the button above.

source: 目前沒有歷史課程
en: No Classes Archived

source: 確定要將本學期移至歷史課程嗎？
en: Are you sure you want to archive the current semester?

source: 確定要清除全部資料嗎？
en: Are you sure you want to clear all info?

source: 移至歷史課程
en: Move to Archive

source: 行事曆
en: Calendar

source: 行事曆提醒時間
en: Calendar Notification Time

source: 行事曆通知
en: Calendar Notifications

source: 複製課程資訊教學
en: Class Info Selection Tutorial

source: 解析失敗
en: AI Decode Failed

source: 課程資訊
en: Class Info

source: 調整提醒時間
en: Adjust Notification Settings

source: 請依照下面的示範 GIF 以及步驟，將課表複製貼上到 NTU Course2Cal。
en: Please follow the following instructions to paste your class info to NTU Course2Cal.

source: 請先在「學期與通知」頁建立或選擇一個學期，再貼上課表內容。
en: Please create or select a semester from Settings, then paste your class info.

source: 請先選擇學期
en: Please Select a Semester

source: 請先選擇或建立一個學期，再貼上課程列表。
en: Please create or select a semester first, then paste your class info.

source: 請設定本學期第一週的「星期一」日期。 App 會根據此日期自動推算所有課程的實際上課日。
en: Please select the first Monday of this semester. The app will automatically predict all class events based on this date.

source: 讀取 Apple 行事曆中...
en: Connecting to Apple Calendar…

source: 讀取 Google 行事曆中...
en: Connecting to Google Calendar…

source: 貼上選課結果
en: Paste Class Info

source: 載入我的日曆
en: Load my Calendar

source: 這裡只影響匯出到 Apple 行事曆事件的提醒時間。
en: Only affects the notifications of exported calendars.

source: 重新排程本學期所有 App 通知
en: Reschedule All Notifications

source: 重新登入
en: Sign in Again

source: 長按「選課結果」標題字樣往下複製，一路拖曳至頁面底部「沒有未選上的課程」結束，點選「複製」。
en: Press and hold the “Enrollment Results” title, drag downward all the way to the bottom of the page until “No Unselected Courses” appears, then tap “Copy”.

source: 開學第一天
en: First Day of Semester

source: 關閉
en: Close

source: 預設匯入日曆
en: Default Export Calendar
